<a href="https://colab.research.google.com/github/LIZZETHGOMEZ/BEDU-Santander-2021/blob/main/Sesion_5_Numpy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Sesion 5 Numpy

In [2]:
import pandas as pd
import numpy as np

In [4]:
np.sum([3,4])

7

In [5]:
serie_1 = [1,2,3,4,5,6,7]
np.power(serie_1,2)

array([ 1,  4,  9, 16, 25, 36, 49])

In [17]:
# Funciones de agregación
serie_2 = pd.Series([1,2,3,4])

In [18]:
#Funciones de agregación me dan un valor unico
serie_2.sum()
serie_2.min() #max
serie_2.mean()
serie_2.count()

4

In [19]:
#Creamos un df
datos = {
    'precio': [34, 54, 223, 78, 56, 12, 34],
    'cantidad_en_stock': [3, 6, 10, 2, 5, 45, 2],
    'productos_vendidos': [3, 45, 23, 76, 24, 6, 2]
}

df = pd.DataFrame(datos, index=["Pokemaster", "Cegatron", "Pikame Mucho", "Lazarillo de Tormes", "Stevie Wonder", "Needle", "El AyMeDuele"])

In [21]:
df.head()

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster               34                  3                   3
Cegatron                 54                  6                  45
Pikame Mucho            223                 10                  23
Lazarillo de Tormes      78                  2                  76
Stevie Wonder            56                  5                  24

In [23]:
df.sum() #El agregado de cada columna

precio                491
cantidad_en_stock      73
productos_vendidos    179
dtype: int64

In [24]:
#cambiar el eje, ahora sumamos por fila
df.sum(axis = 1)

Pokemaster              40
Cegatron               105
Pikame Mucho           256
Lazarillo de Tormes    156
Stevie Wonder           85
Needle                  63
El AyMeDuele            38
dtype: int64

In [28]:
df.max()

precio                223
cantidad_en_stock      45
productos_vendidos     76
dtype: int64

In [29]:
df['precio'].max()

223

### Nan's

In [30]:
np.mean(([1,2,3,np.nan])) #Nos regresara un nan

nan

In [31]:
datos = {
    'precio': [34, 54, np.nan, np.nan, 56, 12, 34],
    'cantidad_en_stock': [3, 6, 14, np.nan, 5, 2, 10],
    'productos_vendidos': [3, 45, 23, np.nan, 24, 6, np.nan]
}

df = pd.DataFrame(datos, index=["Pokemaster", "Cegatron", "Pikame Mucho", "Lazarillo de Tormes", "Stevie Wonder", "Needle", "El AyMeDuele"])

In [32]:
df.head()

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster             34.0                3.0                 3.0
Cegatron               54.0                6.0                45.0
Pikame Mucho            NaN               14.0                23.0
Lazarillo de Tormes     NaN                NaN                 NaN
Stevie Wonder          56.0                5.0                24.0

In [33]:
df.isna()

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster            False              False               False
Cegatron              False              False               False
Pikame Mucho           True              False               False
Lazarillo de Tormes    True               True                True
Stevie Wonder         False              False               False
Needle                False              False               False
El AyMeDuele          False              False                True

In [34]:
df.isna().sum()

precio                2
cantidad_en_stock     1
productos_vendidos    2
dtype: int64

In [35]:
df.isna().sum(axis = 1) # Por filas (quiza podemos eliminar la fila 'Lazarillo de Tormes')

Pokemaster             0
Cegatron               0
Pikame Mucho           1
Lazarillo de Tormes    3
Stevie Wonder          0
Needle                 0
El AyMeDuele           1
dtype: int64

In [37]:
df.dropna(axis = 0, how = 'any') # Cualquier fila que tenga al menos un nan lo elimina

               precio  cantidad_en_stock  productos_vendidos
Pokemaster       34.0                3.0                 3.0
Cegatron         54.0                6.0                45.0
Stevie Wonder    56.0                5.0                24.0
Needle           12.0                2.0                 6.0

In [38]:
df_dropna = df.dropna(axis = 0, how = 'any')
df_dropna.isna().sum() #verificamos que no hay ninguno

precio                0
cantidad_en_stock     0
productos_vendidos    0
dtype: int64

In [39]:
df.dropna(axis = 0, how = 'all') # elimina las filas cuyos TODOS los valores son nan

               precio  cantidad_en_stock  productos_vendidos
Pokemaster       34.0                3.0                 3.0
Cegatron         54.0                6.0                45.0
Pikame Mucho      NaN               14.0                23.0
Stevie Wonder    56.0                5.0                24.0
Needle           12.0                2.0                 6.0
El AyMeDuele     34.0               10.0                 NaN

In [40]:
#Ahora con columnas para al menos un nan
df.dropna(axis = 1, how = 'any')

Empty DataFrame
Columns: []
Index: [Pokemaster, Cegatron, Pikame Mucho, Lazarillo de Tormes, Stevie Wonder, Needle, El AyMeDuele]

In [41]:
df['descuento'] = np.nan
df.head()

In [43]:
# Columna con TODOS los valores nan
df.dropna(axis = 1, how = 'all')

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster             34.0                3.0                 3.0
Cegatron               54.0                6.0                45.0
Pikame Mucho            NaN               14.0                23.0
Lazarillo de Tormes     NaN                NaN                 NaN
Stevie Wonder          56.0                5.0                24.0
Needle                 12.0                2.0                 6.0
El AyMeDuele           34.0               10.0                 NaN

In [49]:
df_no_nans = df.dropna(axis=0, how='all')
df_no_nans = df_no_nans.dropna(axis=1, how='all')

df_no_nans

               precio  cantidad_en_stock  productos_vendidos
Pokemaster       34.0                3.0                 3.0
Cegatron         54.0                6.0                45.0
Pikame Mucho      NaN               14.0                23.0
Stevie Wonder    56.0                5.0                24.0
Needle           12.0                2.0                 6.0
El AyMeDuele     34.0               10.0                 NaN

In [50]:
df_no_nans['productos_vendidos'] = df_no_nans['productos_vendidos'].fillna(0)

df_no_nans

               precio  cantidad_en_stock  productos_vendidos
Pokemaster       34.0                3.0                 3.0
Cegatron         54.0                6.0                45.0
Pikame Mucho      NaN               14.0                23.0
Stevie Wonder    56.0                5.0                24.0
Needle           12.0                2.0                 6.0
El AyMeDuele     34.0               10.0                 0.0

In [53]:
df = pd.read_csv("https://raw.githubusercontent.com/beduExpert/Procesamiento-de-Datos-con-Python-Santander_2020_2021/master/Datasets/melbourne_housing-raw.csv")
df.head()

       Suburb             Address  ...             Regionname Propertycount
0  Abbotsford       68 Studley St  ...  Northern Metropolitan        4019.0
1  Abbotsford        85 Turner St  ...  Northern Metropolitan        4019.0
2  Abbotsford     25 Bloomburg St  ...  Northern Metropolitan        4019.0
3  Abbotsford  18/659 Victoria St  ...  Northern Metropolitan        4019.0
4  Abbotsford        5 Charles St  ...  Northern Metropolitan        4019.0

[5 rows x 21 columns]

In [55]:
df.isna().sum()

Suburb               0
Address              0
Rooms                0
Type                 0
Price             4344
Method               0
SellerG              0
Date                 0
Distance             8
Postcode             8
Bedroom2          4413
Bathroom          4413
Car               4413
Landsize          4796
BuildingArea     11123
YearBuilt        10389
CouncilArea       4444
Lattitude         4292
Longtitude        4292
Regionname           8
Propertycount        8
dtype: int64

In [56]:
df_2 = df.drop(columns = ["BuildingArea", "YearBuilt"])
df_2.head()

           Suburb               Address  ...             Regionname Propertycount
0      Abbotsford         68 Studley St  ...  Northern Metropolitan        4019.0
1      Abbotsford          85 Turner St  ...  Northern Metropolitan        4019.0
2      Abbotsford       25 Bloomburg St  ...  Northern Metropolitan        4019.0
3      Abbotsford    18/659 Victoria St  ...  Northern Metropolitan        4019.0
4      Abbotsford          5 Charles St  ...  Northern Metropolitan        4019.0
...           ...                   ...  ...                    ...           ...
19735     Windsor       201/152 Peel St  ...  Southern Metropolitan        4380.0
19736     Wollert       60 Saltlake Bvd  ...  Northern Metropolitan        2940.0
19737  Yarraville           2 Adeney St  ...   Western Metropolitan        6543.0
19738  Yarraville       54 Pentland Pde  ...   Western Metropolitan        6543.0
19739  Yarraville  10/127 Somerville Rd  ...   Western Metropolitan        6543.0

[19740 rows x 19 columns]

In [59]:
df_2["Regionname"] =df_2["Regionname"].fillna("Unknown")
df_2.isna().sum()

Suburb              0
Address             0
Rooms               0
Type                0
Price            4344
Method              0
SellerG             0
Date                0
Distance            8
Postcode            8
Bedroom2         4413
Bathroom         4413
Car              4413
Landsize         4796
CouncilArea      4444
Lattitude        4292
Longtitude       4292
Regionname          0
Propertycount       8
dtype: int64

In [66]:
df_dropped = df_2.dropna(axis = 0, how = 'any')
df_dropped.isna().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         0
Postcode         0
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
CouncilArea      0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64

In [63]:
df_dropped.shape

(19740, 19)

In [ ]:
#GUARDAMOS EL DF
df_dropped.to_csv("melbourne_housing-no-nans.csv")